CSI API ETABS v1
cAreaElm.GetLoadTemperature Method
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetLoadTemperature(
	string Name,
	ref int NumberItems,
	ref string[] AreaName,
	ref string[] LoadPat,
	ref int[] MyType,
	ref double[] Value,
	ref string[] PatternName,
	eItemTypeElm ItemTypeElm = eItemTypeElm.Element
)
Function GetLoadTemperature (
	Name As String,
	ByRef NumberItems As Integer,
	ByRef AreaName As String(),
	ByRef LoadPat As String(),
	ByRef MyType As Integer(),
	ByRef Value As Double(),
	ByRef PatternName As String(),
	Optional ItemTypeElm As eItemTypeElm = eItemTypeElm.Element
) As Integer
Dim instance As cAreaElm
Dim Name As String
Dim NumberItems As Integer
Dim AreaName As String()
Dim LoadPat As String()
Dim MyType As Integer()
Dim Value As Double()
Dim PatternName As String()
Dim ItemTypeElm As eItemTypeElm
Dim returnValue As Integer
returnValue = instance.GetLoadTemperature(Name,
	NumberItems, AreaName, LoadPat, MyType,
	Value, PatternName, ItemTypeElm)
int GetLoadTemperature(
	String^ Name,
	int% NumberItems,
	array<String^>^% AreaName,
	array<String^>^% LoadPat,
	array<int>^% MyType,
	array<double>^% Value,
	array<String^>^% PatternName,
	eItemTypeElm ItemTypeElm = eItemTypeElm::Element
)
abstract GetLoadTemperature :
        Name : string *
        NumberItems : int byref *
        AreaName : string[] byref *
        LoadPat : string[] byref *
        MyType : int[] byref *
        Value : float[] byref *
        PatternName : string[] byref *
        ?ItemTypeElm : eItemTypeElm
(* Defaults:
        let _ItemTypeElm = defaultArg ItemTypeElm eItemTypeElm.Element
*)
-> int
Parameters
Name
Type: System.String
NumberItems
Type: System.Int32
AreaName
Type: System.String[]
LoadPat
Type: System.String[]
MyType
Type: System.Int32[]
Value
Type: System.Double[]
PatternName
Type: System.String[]
ItemTypeElm (Optional)
Type: ETABSv1.eItemTypeElm
Return Value
Type: Int32
See Also
Reference
cAreaElm Interface
ETABSv1 Namespace